export const seoulAreas = [
  '서울', '강남구', '강동구', '강북구', '강서구', '관악구', '광진구', '구로구', '금천구', '노원구', '도봉구', '동대문구', '동작구', '마포구', '서대문구', '서초구', '성동구', '성북구', '송파구', '양천구', '영등포구', '용산구', '은평구', '종로구', '중구', '중랑구',
  '역삼동', '삼성동', '청담동', '논현동', '신사동(강남구)', '압구정동', '대치동', '도곡동', '개포동', '세곡동', '일원동', '수서동', '강남역', '가로수길', '코엑스', '봉은사',
  '천호동', '암사동', '성내동', '길동', '고덕동', '둔촌동', '명일동', '상일동', '강동역',
  '수유동', '미아동', '번동', '우이동', '삼양동', '솔샘로', '북서울꿈의숲',
  '마곡동', '발산동', '등촌동', '화곡동', '가양동', '염창동', '김포공항', '서울식물원',
  '봉천동', '신림동', '낙성대', '서울대입구', '샤로수길',
  '건대입구', '화양동', '자양동', '구의동', '중곡동', '어린이대공원',
  '구로동', '신도림동', '개봉동', '오류동', '가리봉동', '디지털단지',
  '가산동', '독산동', '시흥동', '가산디지털단지',
  '상계동', '중계동', '공릉동', '하계동', '태릉입구',
  '창동', '쌍문동', '방학동', '도봉동', '도봉산',
  '회기동', '청량리', '장안동', '이문동', '전농동', '경희대', '외대앞',
  '노량진', '상도동', '흑석동', '사당동', '보라매', '숭실대입구',
  '망원동', '서교동', '홍대', '합정동', '연남동', '상수동', '공덕동', '아현동', '상암동', '월드컵경기장', 'DMC',
  '신촌', '연희동', '홍제동', '북가좌동', '남가좌동', '충정로', '이대',
  '서초동', '반포동', '잠원동', '양재동', '방배동', '교대', '고속터미널', '예술의전당',
  '성수동', '서울숲', '뚝섬', '왕십리', '행당동', '금호동', '옥수동', '한양대',
  '성북동', '안암동', '정릉동', '길음동', '월곡동', '석계', '고려대',
  '잠실동', '방이동', '송리단길', '석촌동', '문정동', '가락동', '거여동', '마천동', '올림픽공원', '롯데월드',
  '목동', '신정동', '신월동', '오목교',
  '여의도동', '영등포동', '당산동', '문래동', '신길동', '대림동', '타임스퀘어',
  '이태원동', '한남동', '용산역', '후암동', '해방촌', '삼각지', '효창동', '남영동',
  '불광동', '연신내', '응암동', '녹번동', '구산동', '은평한옥마을',
  '종로', '대학로', '혜화동', '익선동', '인사동', '삼청동', '북촌', '광화문', '서촌', '부암동', '평창동', '창덕궁',
  '명동', '을지로', '충무로', '동대문', '신당동', '약수동', '서울역', '남산', '남대문시장',
  '면목동', '상봉동', '중화동', '묵동', '망우동', '용마산',
] as const

export function isSeoulArea(area: string) {
  return seoulAreas.includes(area.trim() as typeof seoulAreas[number])
}
